[
  {
    "id": "1/1/1",
    "mandal": "1",
    "sukt": "1",
    "mantra": "1",
    "devta": "अग्नि",
    "rishi": "मधुच्छन्दाः वैश्वामित्रः",
    "chhand": "गायत्री",
    "swar": "षड्जः",
    "mantra_hi": "अ॒ग्निमी॑ळे पु॒रोहि॑तं य॒ज्ञस्य॑ दे॒वमृ॒त्विज॑म्। होता॑रं रत्न॒धात॑मम्॥",
    "padpath": "अ॒ग्निम्। ई॒ळे॒। पु॒रःऽहि॑तम्। य॒ज्ञस्य॑। दे॒वम्। ऋ॒त्विज॑म्। होता॑रम्। र॒त्न॒ऽधात॑मम् ॥",
    "commentator": "स्वामी दयानन्द सरस्वती",
    "swami-dayanand": {
      "heading_hi": "यहाँ प्रथम मन्त्र में अग्नि शब्द करके ईश्वर ने अपना और भौतिक अर्थ का उपदेश किया है।",
      "padarth_hindi": "हम लोग (यज्ञस्य) विद्वानों के सत्कार सङ्गम महिमा और कर्म के (होतारम्) देने तथा ग्रहण करनेवाले (पुरोहितम्) उत्पत्ति के समय से पहिले परमाणु आदि सृष्टि के धारण करने और (ऋत्विजम्) वारंवार उत्पत्ति के समय में स्थूल सृष्टि के रचनेवाले तथा ऋतु-ऋतु में उपासना करने योग्य (रत्नधातमम्) और निश्चय करके मनोहर पृथिवी वा सुवर्ण आदि रत्नों के धारण करने वा (देवम्) देने तथा सब पदार्थों के प्रकाश करनेवाले परमेश्वर की (ईळे) स्तुति करते हैं। तथा उपकार के लिये हम लोग (यज्ञस्य) विद्यादि दान और शिल्पक्रियाओं से उत्पन्न करने योग्य पदार्थों के (होतारम्) देनेहारे तथा (पुरोहितम्) उन पदार्थों के उत्पन्न करने के समय से पूर्व भी छेदन धारण और आकर्षण आदि गुणों के धारण करनेवाले (ऋत्विजम्) शिल्पविद्या साधनों के हेतु (रत्नधातमम्) अच्छे-अच्छे सुवर्ण आदि रत्नों के धारण कराने तथा (देवम्) युद्धादिकों में कलायुक्त शस्त्रों से विजय करानेहारे भौतिक अग्नि की (ईळे) वारंवार इच्छा करते हैं।",
      "bhawarth_hindi": "इस मन्त्र में श्लेषालङ्कार से दो अर्थों का ग्रहण होता है। पिता के समान कृपाकारक परमेश्वर सब जीवों के हित और सब विद्याओं की प्राप्ति के लिये कल्प-कल्प की आदि में वेद का उपदेश करता है। जैसे पिता वा अध्यापक अपने शिष्य वा पुत्र को शिक्षा करता है कि तू ऐसा कर वा ऐसा वचन कह, सत्य वचन बोल, इत्यादि शिक्षा को सुनकर बालक वा शिष्य भी कहता है कि सत्य बोलूँगा, पिता और आचार्य्य की सेवा करूँगा, झूठ न कहूँगा, इस प्रकार जैसे परस्पर शिक्षक लोग शिष्य वा लड़कों को उपदेश करते हैं, वैसे ही अग्निमीळे० इत्यादि वेदमन्त्रों में भी जानना चाहिये। क्योंकि ईश्वर ने वेद सब जीवों के उत्तम सुख के लिये प्रकट किया है। इसी वेद के उपदेश का परोपकार फल होने से अग्निमीळे० इस मन्त्र में ईडे यह उत्तम पुरुष का प्रयोग भी है। (अग्निमीळे०) इस मन्त्र में परमार्थ और व्यवहारविद्या की सिद्धि के लिये अग्नि शब्द करके परमेश्वर और भौतिक ये दोनों अर्थ लिये जाते हैं। जो पहिले समय में आर्य लोगों ने अश्वविद्या के नाम से शीघ्र गमन का हेतु शिल्पविद्या आविष्कृत की थी, वह अग्निविद्या की ही उन्नति थी। परमेश्वर के आप ही आप प्रकाशमान सब का प्रकाशक और अनन्त ज्ञानवान् होने से, तथा भौतिक अग्नि के रूप दाह प्रकाश वेग छेदन आदि गुण और शिल्पविद्या के मुख्य साधक होने से अग्नि शब्द का प्रथम ग्रहण किया है ॥",
      "heading_sanskrit": "तत्राद्ये मन्त्रेऽग्निशब्देनेश्वरेणात्मभौतिकावर्थावुपदिश्येते।",
      "anvay_sanskrit": "अहं यज्ञस्य पुरोहितमृत्विजं होतारं रत्नधातमं देवमग्निमीळे",
      "padarth_sanskrit": "(अग्निम्) परमेश्वरं भौतिकं वा। इन्द्रं॑ मि॒त्रं वरु॑णम॒ग्निमा॑हुरथो॑ दि॒व्यः स सु॒प॒र्णो ग॒रुत्मा॑न्। एकं॒ सद्विप्रा॑ बहु॒धा व॑दन्त्य॒ग्निं य॒मं मा॑त॒रिश्वा॑नमाहुः॥ (ऋ०१.१६४.४६) अनेनैकस्य सतः परब्रह्मण इन्द्रादीनि बहुधा नामानि सन्तीति वेदितव्यम्। तदे॒वाग्निस्तदा॑दि॒त्यस्तद्वा॒युस्तदु॑ च॒न्द्रमाः॑। तदे॒व शु॒क्रं तद् ब्रह्म॒ ता आपः॒ स प्र॒जाप॑तिः॥ (य०३२.१) यत्सच्चिदानन्दादिलक्षणं ब्रह्म तदेवात्राग्न्यादिनामवाच्यमिति बोध्यम्। ब्रह्म ह्यग्निः। (श०ब्रा०१.४.२.११) आत्मा वा अग्निः। (श०ब्रा०७.२.३.२) अत्राग्निर्ब्रह्मात्मनोर्वाचकोऽस्ति। अयं वा अग्निः प्रजाश्च प्रजापतिश्च। (श०ब्रा०९.१.२.४२) अत्र प्रजाशब्देन भौतिकः प्रजापतिशब्देनेश्वरश्चाग्निर्ग्राह्यः। अग्निर्वै देवानां व्रतपतिः। एतद्ध वै देवा व्रतं चरन्ति यत्सत्यम्। (श०ब्रा०१.१.१.२,५) सत्याचारनियमपालनं व्रतं तत्पतिरीश्वरः। त्रि॒भिः प॒वित्रै॒रपु॑पो॒द्ध्य१॒॑र्कं हृ॒दा म॒तिं ज्योति॒रनु॑ प्रजा॒नन्। वर्षि॑ष्ठं॒ रत्न॑मकृत स्व॒धाभि॒रादिद् द्यावा॑पृथि॒वी पर्य॑पश्यत्॥ (ऋ०३.२६.८) अत्राग्निशब्दस्यानुवृत्तेः प्रजानन्निति ज्ञानवत्वात् पर्य्यपश्यदिति सर्वज्ञत्वादीश्वरो ग्राह्यः। यास्कमुनिरत्रोभयार्थकरणायाग्निशब्दपुरःसरमेतन्मन्त्रमेवं व्याचष्टे−अग्निः कस्मादग्रणीर्भवत्यग्रं यज्ञेषु प्रणीयतेऽङ्गं नयति सन्नममानोऽक्नोपनो भवतीति स्थौलाष्ठीविर्न क्नोपयति न स्नेहयति त्रिभ्य आख्यातेभ्यो जायत इति शाकपूणिरितादक्ताद्दग्धाद्वा नीतात्स खल्वेतेरकारमादत्ते गकारमनक्तेर्वा दहतेर्वा नीःपरस्तस्यैषा भवतीति−अग्निमीळे० अग्निं याचामीळिरध्येषणाकर्मा पूजाकर्मा वा। देवो दानाद्वा दीपनाद्वा द्योतनाद्वा द्युस्थानो भवतीति वा, यो देवः सा देवता। होतारं ह्वातारं जुहोतेर्होतेत्यौर्णवाभो रत्नधातमं रमणीयानां धनानां दातृतमम्। (निरु०७.१४-१५)। अग्रणीः सर्वोत्तमः सर्वेषु यज्ञेषु पूर्वमीश्वरस्यैव प्रतिपादनात्तस्यात्र ग्रहणम्। दग्धादिति विशेषणाद्भौतिकस्यापि च। प्रशासितारं सर्वेषामणीयांसमणोरपि। रुक्माभं स्वप्नधीगम्यं विद्यात्तं पुरुषं परम् ॥१॥ एतमेके वदन्त्यग्निं मनुमन्ये प्रजापतिम्। इन्द्रमेकेऽपरे प्राणमपरे ब्रह्म शाश्वतम् ॥२॥ (मनु०१२.१२२-१२३) अत्राप्यग्न्यादीनि परमेश्वरस्य नामानि सन्तीति। ईळे॑ अ॒ग्निं वि॑प॒श्चितं॑ गि॒रा य॒ज्ञस्य॒ साध॑नम्। श्रु॒ष्टी॒वानं॑ धि॒तावा॑नम्॥ (ऋ०३.२७.२) विपश्चितमीळे इति विशेषणादग्निशब्देनात्रेश्वरो गृह्यते, अनन्तविद्यावत्त्वाच्चेतनस्वरूपत्वाच्च। अथ केवलं भौतिकार्थग्रहणाय प्रमाणानि−यदश्वं तं पुरस्तादुदश्रयंस्तस्याभयेऽनाष्ट्रे निवातेऽग्निरजायत तस्माद्यत्राग्निं मन्थिष्यन्त्स्यात्तदश्वमानेतवै ब्रूयात्। स पूर्वेणोपतिष्ठते वज्रमेवैतदुच्छ्रयन्ति तस्याभयेऽनाष्ट्रे निवातेऽग्निर्जायते। (श०ब्रा०२.१.४.१६) वृषो अग्निः। अश्वो ह वा एष भूत्वा देवेभ्यो यज्ञं वहति। (श०ब्रा०१.३.३.२९-३०) अग्निर्वा अश्वः। (श०ब्रा०३.६.२.५) वृषवद्यानानां वोढृत्वाद् वृषोऽग्निः। तथाऽयमग्निराशुगमयितृत्वेनाश्वो भूत्वा कलायन्त्रैः प्रेरितः सन् देवेभ्यो विद्वद्भ्यः शिल्पविद्याविद्भ्यो मनुष्येभ्यो विमानादियानसाधनसङ्गतं यानं वहति प्रापयतीति। तूर्णिर्हव्यवाडिति। (श०ब्रा०१.३.४.१२) अयमग्निर्हव्यानां यानानां प्रापकत्वेन शीघ्रतया गमकत्वाद्धव्यवाट् तूर्णिश्चेति। अग्निर्वै योनिर्यज्ञस्य। (श०ब्रा०१.४.३.११) इत्याद्यनेकप्रमाणैरश्वनाम्ना भौतिकोऽग्निर्वात्र गृह्यते, आशुगमनहेतुत्वा-दश्वोऽग्निर्विज्ञेयः। वृषो॑ अ॒ग्निः समि॑ध्य॒तेऽश्वो॒ न देव॒वाह॑नः। तं ह॒विष्म॑न्त ईळते॥ (ऋ०३.२७.१४) यदा शिल्पिभिरयमग्निर्यन्त्रकलाभिर्यानेषु प्रदीप्यते तदा देववाहनो देवान् यानस्थान् विदुषः शीघ्रं देशान्तरेऽश्व इव वृष इव च प्रापयति, तं हविष्मन्तो मनुष्या वेगादिगुणवन्तमश्वमग्निमीडते कार्य्यार्थमधीच्छन्तीति वेद्यम्। (ईळे) स्तुवे याचे अधीच्छामि प्रेरयामि वा (पुरोहितम्) पुरस्तात्सर्वं जगद्दधाति छेदनधारणाकर्षणादिगुणांश्चापि तम्। पुरोहितः पुर एनं दधति होत्राय वृतः कृपायमाणोऽन्वध्यायत्। (निरु०२.१२) (यज्ञस्य) इज्यतेऽसौ यज्ञस्तस्य महिम्नः कर्मणो विदुषां सत्कारस्य सङ्गतस्य सत्सङ्गत्योत्पन्नस्य विद्यादिदानस्य शिल्पक्रियोत्पाद्यस्य वा। यज्ञः कस्मात्प्रख्यातं यजति कर्मेति नैरुक्ता याञ्चो भवतीति वा यजुरुन्नो भवतीति वा बहुकृष्णाजिन इत्यौपमन्यवो यजूंष्येनं नयन्तीति वा। (निरु०३.१९) (देवम्) दातारं हर्षकरं विजेतारं द्योतकं वा (ऋत्विजम्) य ऋतौ ऋतौ प्रत्युत्पत्तिकालं संसारं यजति सङ्गतं करोति तथा च शिल्पसाधनानि सङ्गमयति सर्वेषु ऋतुषु यजनीयस्तम्। ऋत्विग्दधृग्० (अष्टा०३.२.५९) अनेन कर्त्तरि निपातनम्, तथा कृतो बहुलमिति कर्मणि वा। (होतारम्) दातारमादातारं वा (रत्नधातमम्) रमणीयानि पृथिव्यादीनि सुवर्णादीनि च रत्नानि दधाति धापयतीति रत्नधा, अतिशयेन रत्नधा इति रत्नधातमस्तम् |",
      "bhawarth_sanskrit": "इतोऽग्रे यत्र यत्र मन्त्रभूमिकायामुपदिश्यत इति क्रियापदं प्रयुज्यतेऽस्य सर्वत्र कर्त्तेश्वर एव बोध्यः। कुतः, वेदानां तेनैवोक्तत्वात्। पितृवत्कृपायमाण ईश्वरः सर्वविद्याप्राप्तये सर्वजीवहितार्थं वेदोपदेशं चकार। यथा पिताऽध्यापको वा स्वपुत्रं शिष्यं च प्रति त्वमेवं वदैवं कुरु सत्यं वद पितरमाचार्य्यं च सेवस्वानृतं मा कुर्वित्युपदिशति, तथैवात्र बोध्यम्। वेदश्च सर्वजीवकल्याणार्थमाविर्भूतः। वेदोपदेशस्य परोपकारार्थत्वात्। एवमर्थोऽत्रोत्तमपुरुषप्रयोगः। अत्राग्निशब्देन परमार्थव्यवहारविद्यासिद्धये परमेश्वरभौतिकौ द्वावर्थौ गृह्येते। पुरा आर्य्यैर्याऽश्वविद्यानाम्ना शीघ्रगमनहेतुः शिल्पविद्या सम्पादितेति श्रूयते, साग्निविद्यैवासीत्। परमेश्वरस्य स्वयंप्रकाशत्वसर्वप्रकाशक-त्वाभ्यामनन्तज्ञानवत्त्वात् भौतिकस्य रूपदाहप्रकाशवेगछेदनादिगुणवत्त्वाच्छिल्पविद्यायां मुख्यहेतुत्वाच्च प्रथमं ग्रहणं कृतमस्तीति वेदितव्यम् |",
      "tippani": ""
    },
    "sayan": {
      "heading_hi": "",
      "heading_sanskrit": "",
      "padarth_sanskrit": "",
      "padarth_hindi": "",
      "anvay_sanskrit": "",
      "bhawarth_sanskrit": "",
      "bhawarth_hindi": "",
      "tippani": ""
    }
  },
  {
    "id": "2/1/2",
    "mandal": "1",
    "sukt": "1",
    "mantra": "2"
  }
]
